Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, MAYA'S WORLD.tmx
Source language: id
Languages: en

source: Hmm… Kayaknya saya masih butuh referensi lain, tapi apa ya?
en: hmm... I think I need to find more references. where should I start looking?

source: KAMU ITU LHO.
en: well-being.

source: LUMAYAN,
en: down. she’s

source: WOI!
en: hey!

source: Maaf…
en: sorry...

source: SINI.
en: him.

source: CURIGA GAK
en: to get the wrong

source: MALAH DIA YANG SAMPE SEKARANG NGGAK KETEMU-KETEMU RADI…
en: but now he’s completely lost as to where radi may be.

source: Gue baru juga mau nyusul lo ke sana?!!!
en: I was about to go there!

source: Tadi kan sempet ditanyain yang ini, coba tambahin.
en: some clarification is needed here, so maybe you should elaborate more.

source: HECTIC BANGET
en: too busy

source: gimana kalo ternyata maya masih nggak bisa diganggu? gimana kalo dia emang...
en: what if maya doesn’t want to be disturbed? what if she...

source: GUE PAPASAN SAMA
en: I bumped into laras

source: MULU.
en: so restless.

source: MAMA JUGA...
en: I couldn’t

source: TERJADI DI SEKOLAH?
en: at school.

source: RADI TERNYATA
en: I only learned

source: GAK
en: no,

source: tau ‘kan? kayak troubleshooting laptop gitu!
en: you know, it’s like when you have to troubleshoot your laptop.

source: SIANG BOLONG
en: no

source: Apa kita nggak bisa kayak dulu lagi?
en: is it impossible for us to return to the way things were?

source: MAU YA,
en: so, are you

source: ABIS ITU SUKA LAGI, TAPI ABIS LIAT TA-KU LAGI, AKU NEMU SESUATU YANG LAIN, TRUS AKU GANTI TEMA LAGI.
en: after some time, I might get back into them. but then again, if I look over my thesis, I might want to change the subject again because I found something else.

source: BERAPA?
en: are you in?

source: DAN SELAMA
en: plus,

source: DUUUUH!!
en: tsk...

source: TAPI SAYA
en: I really

source: KALIAN EMANGNYA
en: what good

source: NGGAK… BUKAN GITU… YAH… CEPAT ATAU LAMBAT DIA JUGA BAKAL TAU SIH…
en: no, he won’t. well, I know... sooner or later, he’ll find out about it.

source: NGGAK RAS KEBETULAN DIA BUKAN ADMIN PROVIDER.
en: nope, it’s not like he has regular business hours like customer service representatives.

source: AYO
en: okay, come on.

source: Tok tok!
en: knock knock

source: BYE~ TITIP
en: bye! take care

source: WALAUPUN SEBENARNYA SEMUA YANG SAYA OMONGIN BERDASARKAN PENGALAMAN SAYA SIH…
en: ...despite the fact that what I told her was true.

source: TAKUT?
en: “afraid”?

source: AKU TAKUT KETEMU LARAS.
en: I’m afraid to meet with her.

source: (DIA BILANG SEAKAN-AKAN GAK KENAL, TAPI KOK LANCAR-LANCAR AJA NGOBROLNYA…)
en: (she said that she wasn’t very close with his friends, but the way she approached them doesn’t seem that way...)

source: zona maya
en: maya’s world

source: KALO URUSAN
en: the time to catch up

source: …LOH… SIAPA MEREKA…?
en: huh...? who are they...?

source: TAU DIRI JUGA LAH,
en: be aware

source: Tapi nyatanya…
en: but in reality...

source: Yang berkali-kali saya lakukan… hanya memastikan agar air mata Radi udah berhenti mengalir, memastikan Radi udah siap menghadapi semuanya…
en: I just wanted to make sure there were no more tears in his eyes. I wanted to make sure he was ready to move on...

source: Sebelum pulang, jangan lupa kunjungin kuburan papamu ya, nak.
en: oh, don’t forget to visit your father’s grave, okay?

source: kok nggak ngomong se?
en: she should’ve told me this earlier.

source: Saya nggak tau.
en: I don’t know.

source: menurut saya itu udah nggak penting lagi.
en: that doesn’t matter to me anymore.

source: KEMANA
en: where,

source: Saya kira ini adalah keputusan yang terbaik buat saya dan Radi…
en: I thought this was the best for us.

source: Lo mau ke Radi duluan?
en: do you wanna go see him first?

source: DAH NONGOL.
en: the devil.

source: …SORI, MAY…
en: I’m sorry...

source: TAPI BANYAK ORANG GIMANA DONG.
en: but you saw for yourself how crowded it was.

source: kalo dah siap cerita ya!!!!
en: feel free to talk to us when you’re ready!!!

source: PUTUS?
en: break up?

source: EMANG
en: is your

source: Tapi apa yang gua lakuin ke Maya… bikin Maya susah percaya lagi sama gua.
en: but because of all the things I did to her... it was difficult for her to trust me again.

source: KE TOILET
en: I need help

source: astaghfirullah ada mayit!!!
en: there’s a dead person here!!!

source: LO INGET APA YANG TERJADI
en: do you remember

source: NYALI LU NGEHAJAR
en: for beating up

source: SAMA AJA MENGULANG KEJADIAN PEDAL.
en: it would’ve been like doing it all over again...

source: … ya… Kalo bisa ditutup pelan-pelan aja buk dari pada kekunci di luar…
en: well, make sure you close it gently from now on, or else the door will get stuck again.

source: UDAH NGGAK ADA KOK CICAKNYA.
en: sure.

source: SAYA NGGAK?
en: of course.

source: TAPI SEBENERNYA
en: to be honest,

source: YANG TADINYA SUMPAH NGERJAIN T.A MENDADAK BAGUS MOOD AING…
en: when I’m stuck with my thesis, these cakes are definitely a mood booster!

source: MAKA DARI
en: therefore,

source: aduh!
en: ouch!

source: Karena dia penting buat gua, menghargai keputusan dia pun udah cukup.
en: since she’s so important to me, respecting her decision is enough.

source: Paling hoki aja lagi enak kali yaaa!!
en: maybe this is just a coincidence!

source: CEK LAPANGAN,
en: with your field observation,

source: KE PERPUS DULU
en: the library!

source: UNKNOWN NUMBER?!
en: an unknown number?!

source: GUE NGERASA
en: I feel like

source: Oh oke.
en: okay.

source: AH NGGAK BU,
en: well,

source: DIRINYA KE
en: to her

source: GEDE JUGA
en: you’ve got some guts

source: NANYAIN SOAL
en: pasar

source: DATENG!!
en: departing!

source: NAK?!
en: interning?

source: SAYA HARAP MASALAH KALIAN SELESAI DENGAN BAIK, SAYA DULUAN YA.
en: I hope you and laras will work things out. I’ll see you around.

source: KETEMU BINTANG,
en: I met bintang

source: AKHIR SEMESESTER
en: we’ve been

source: CERITA.
en: not ready.

source: BUAT KETEMU
en: to meet

source: Katanya yang punya gedung apartemen ini…
en: the owner of this apartment, I guess.

source: DIA MAU FOKUS
en: on

source: BANGET KALO
en: he really cares

source: Seneng… soalnya Maya nggak pernah milih matkul pilihan Seni Rupa.
en: I did... I’d never taken an art class before.

source: RADIM MULUTNYA!!!
en: watch your language!

source: orang lain
en: the others

source: JELAS 'KAN?
en: right?

source: Dari awal apartemen ini ada kamar itu gak boleh ditempatin siapa-siapa!
en: from the moment this apartment was built, nobody should have access to that room!

source: Apaan sih ini orang…
en: what’s his problem?

source: TELAT,
en: how

source: oh dp 4 lo udah kelar?
en: have you finished the design?

source: DAH!
en: just dump him?

source: HH… YA GUE TAHU SIH GUE EMANG HARUS BALIK KE KELUARGA GUE, TAPI GUE BELOM BISA KALO URUSAN GUE SAMA RADI BELOM KELAR…
en: yeah, I know I should return to my family, but I won’t be able to do that until I’ve settled my business with radi.

source: MAMA EMANG SELALU
en: we both know

source: GUE CARI-CARI KEBAIKANNYA.
en: the good side of things.

source: Apa lu nyaman sama hubungan kayak gini?
en: are you really okay with us being like this?

source: MASUK.
en: come in.

source: HEI!!!
en: hey!

source: ‘Kan kamu bakal lama tuh internship di Jepang, seenggaknya di rumah dulu abis semua tugas kamu selesai
en: you’re going to be away for quite a long time, right? so, spend some time at home when you’re done with your projects.

source: SAYA PENGEN
en: if you don’t mind.

source: YANG BERSEDIA
en: and asked him

source: MENYENANGKAN
en: go very smoothly

source: KIRAIN SEUMURAN
en: I thought you were

source: BAKAL SANGAT
en: how difficult

source: SORI, GUE
en: sorry...

source: ya allah maaa...
en: oh man...

source: AJA DULU,
en: in getting a head start,

source: LIAT NOMOR
en: to read

source: JUGA DEH.
en: exhausted.

source: SAYANG BANGET YA, PADAHAL BAGUS, KALO DI DIIJININ SAYA PENGEN AMBIL SATU KARYANYA HAHAHA TAPI NGGAK BOLEH KAYAK GITU YA!!
en: It’s unfortunate that no one cares for the artwork. I think they’re lovely pieces of art. if it were possible, I’d take one of their works, hahaha!

source: episode 56 Bersama Dengan Kepastian
en: episode 56 one with certainty

source: HAHH… SEDIH BANGET…
en: huhu... so sad...

source: GUA BAKAL
en: I’ll explain

source: DARI
en: he seemed

source: Mungkin dengan gue bisa nyelametin lo dari Jordan, bisa bikin lo ngeliat ke arah gue lagi…
en: I hoped that by saving you from jordan, you’d change your mind and return your attention to me.

source: ...pusing.
en: I’m dizzy...

source: "ToLonG!"
en: “Help!”

source: LAGI?
en: wrong?

source: TEMEN LU
en: what’s up

source: LAGI, NYAMPE
en: so I should be arrived

source: Awas ya kalo sampe sakit!!!!
en: I don’t want you to get sick!

source: ITU, KITA BALIK
en: let’s reverse

source: ORANG ISENG...
en: foolery...

source: episode 59 Tapi Saya Harus
en: episode 59 I’ve got to...

source: sman z bandung
en: Z high school

source: KITTY SELALU TAU KEBERADAAN GUE, KARENA DIA UDAH TAU KEBIASAAN GUE DARI KECIL… ITU YANG LEBIH GUE TAKUTIN…
en: kitty’s been aware of my routine since I was little, so he knows exactly where I am at all times. that’s the thing I’m most afraid of, though.

source: SAMA KAYAK JAMES, GUE AKHIRNYA
en: just like James, in the end...

source: RAD.
en: you go.

source: oh ini? gue kira cabe raksasa anjir!
en: oh? I thought this was a giant chili pepper!

source: NUNGGUIN MBAK
en: read it again

source: Oke Pak.
en: okay, sir.

source: YANG NYATANYA
en: but by doing so,

source: Soal aku nggak usah kamu pikirin, aku emang lagi mumet, tapi aku udah tau ini bakal terjadi.
en: get me out of your mind. actually, I saw it coming.

source: KALI INI, DIA KAYAKNYA
en: since she seems really interested

source: LANCANG JUGA
en: I shouldn’t

source: Gue harus ceritain ini semua ke lo, biar lo gak punya prasangka kayak gini terus ke gue, selagi gue di sini.
en: let me clear things up so that you no longer have these negative feelings toward me.

source: MENURUT SAYA TAKUT ITU WAJAR, TAPI KALAU RASA TAKUT ITU KAMU SIMPAN SENDIRI, BISA BERBAHAYA.
en: you see, even though being afraid is normal, it’s dangerous if you keep it to yourself.

source: Ada-ada aja deh, mentang-mentang gedung ini nggak pernah gue kunjungin, bukan berarti kalian seenaknya!
en: for god’s sake! just because I’m away all the time doesn’t mean you can do whatever you want!

source: hah?!!
en: what?!

source: NIH,
en: here

source: dibalik tubuh yang mungil ini...
en: beneath this fragile body

source: TRUS DIA
en: she’s

source: Wido
en: widodo

source: YA AMPUN MAYA KAMU MENYEDIHKAN BANGET?!!!!
en: poor you, my little sister...

source: UMM… YA… TAPI KARYA TUGAS AKHIR AKU NGGAK SEGEDE ITU SIH…
en: um... yeah... but it’s not that big, I guess...

source: …SI BRENGSEK ITU MASIH BELUM NGEHUBUNGIN LARAS JUGA?!!!
en: that son of a gun hasn’t called laras yet?!

source: udeh.
en: sure.

source: nggak perlu sampe ngulang ah?!! lebay deh dosbing kamu?!!
en: you don’t have to start over!!! argh! what was your supervisor thinking?!

source: SRET
en: fwip

source: GUE BAKAL NINGGALIN SEKOLAH INI...
en: and I’ll leave this place for good!

source: ATTACK BUAT
en: attack for me,

source: keesokan harinya…
en: the next day...

source: NANTI?
en: come, mom?

source: INI DALAM VERSI
en: your thesis

source: MALAH BINGUNG
en: so stressed back then.

source: LO NGGAK BERMAKSUD NGEDIEMIN DIA ‘KAN?
en: but you didn’t mean to ghost her, did you?

source: Gue susul aja deh.
en: fine... I’ll just go see them.

source: SKRIPSINYA KARENA
en: to continue working on her thesis

source: SEMBUH!
en: her meds!

source: Udah nih, udah bisa.
en: there you go. all done.

source: tara ngasih buku ini ke aku, katanya ini barang penting maya
en: tara gave me this book. he said it belonged to maya and that she had treasured it.

source: SAYA BERDEBAR
en: I feel like my heart’s

source: MASIH 30
en: it’ll depart

source: padahal dari dulu dia udah ngomong kayak gitu ke gua
en: that’s something she’s told me before.

source: NAK
en: radi,

source: Hai semuanya komik ini akan Hiatus sampai bulan Januari!
en: hi, everyone! I have a quick announcement for you! this comic will be on a hiatus until January.

source: TUMBEN BANGET NGGAK REWEL… KURANG MAHAL ROTINYA?!
en: really? he didn’t even complain about how cheap the bread is or anything?

source: LAGIAN
en: even when

source: episode 68 Demi Sebuah Pilihan
en: episode 68 for a decision

source: GUE NGGAK BEGITU KENAL SAMA TEMEN-TEMENNYA SIH TAPI…
en: I’m not particularly close to his social circle, but...

source: IYA, HAL-HAL
en: yup!

source: TEH...
en: right now.

source: LO NGANTER
en: while you wait

source: KEMAREN KATANYA
en: were gonna do it

source: HAAAH...
en: huff...

source: Gue juga harus benerin hubungan gue dan Bintang yang lagi kacau akhir-akhir ini.
en: I have to fix my relationship with bintang that’s been in a wreck lately.

source: Srek!
en: rustle

source: KAMU
en: are you

source: DIA YA YANG
en: he was the one

source: DIRI GINI?
en: like this?

source: ras, kamu masih ada rasa ‘kan sebenernya sama radi?
en: ayu, you still have feelings for Radi, right?

source: KALI INI, KAMU
en: what’s your

source: MGGAK JUGA, KAMI BEDA ANGKATAN, UDAH GITU JURUSAN KAMI BEDA.
en: not really. we’re not in the same year or studying the same subjects.

source: EMANGNYA NGGAK
en: find one

source: KELUARGA.
en: my family first.

source: EH TU
en: oh,

source: ANAK INI?!!!
en: this ungrateful punk-!

source: SAYA MAU.
en: liked.

source: Kita mau sampai kapan kayak gini, May?
en: how long are you going to keep this up, maya?

source: KOK BISA
en: yeah?!

source: GUE NGGAK NGERTI APA-APA SOAL SIDANG YA, TAPI MENURUT GUE, LO JAWABNYA KURANG RINGKAS DEH.
en: I’m not an expert in this field, but I think your answer is a little confusing.

source: PASTI PANIK,
en: to get her ticket.

source: KOK!
en: it.

source: WAH RAS MAKASIH BANGET LOOH!!!
en: thank you very much for the cake, laras!

source: KARYA KERAMIK
en: your

source: Dari kecil gue nggak pernah maen petak umpet, ternyata seru juga ya.
en: I’ve never played hide-and-seek before... turns out it’s pretty fun.

source: SAYA DITERIMA DI
en: into a college

source: akhir stasiun
en: to gambir

source: JIKA MASING-MASING KITA BERADA DI ANGKA 50%, APAKAH SALAH SATU DARI KITA TERUS-MENERUS MENGISI YANG 50% ITU?
en: suppose our lives are half full, would our partners be able to fill the remaining half of the void?

source: Kenapa perasaan ini segitu mengganggunya buat gue?
en: why do these feelings really bug me?

source: tapi saya rasa lebih baik kayak gitu, ganti topik satu-satunya jalan keluar.
en: I think it’d be best if I start over. changing the thesis topic is the only way out.

source: GUE
en: I

source: kita ke tujuan
en: you

source: BARUSAN
en: I read

source: KETANGKEP BASAH,
en: to the teachers.

source: KELUARGA LO.
en: about your family.

source: Ngomong-ngomong kamu siapanya neng Ayu?
en: anyway, are you a friend of laras?

source: JIKA MASING-MASING DI ANTARA KITA NGGAK ADA YANG SADAR SOAL BAIK BURUKNYA DIRI KITA, AKAN SEMAKIN SULIT BUAT NERUSIN SEBUAH HUBUNGAN YANG MELIBATKAN PERASAAN DENGAN ORANG LAIN.
en: if we don’t know the good and bad things about ourselves, it will be harder and harder to keep up a relationship with someone... where feelings are involved.

source: SAYA DISARANIN JANGAN
en: my advisor said

source: dengan namaku
en: my name!

source: DOANG KOK MA,
en: take long.

source: "Kalau Ramai
en: “Maybe you

source: LO TAU
en: you guys know

source: BISA TERLIBAT
en: you'll also

source: MAU KEMANA
en: are you

source: YANG BIKIN
en: the one

source: NANTI GUE
en: I’ll tell

source: NGGAK LANGSUNG KASIH TAU LARAS?
en: and you didn’t let laras know right away?

source: BANYAK WAKTU
en: have

source: LIAT AKU SIDANG...
en: to be there.

source: karena kamu lagi kesasar, coba kamu cari jawabannya dari tempat awal kamu berangkat, mungkin bakal ketemu jawabannya?
en: try to go back to where you started. maybe you’ll find the answer.

source: SELAMA INI
en: all of

source: Kapan.
en: when would that be?

source: PULANG?
en: home?

source: BU...
en: it’s

source: ANGKAT.
en: sleeping.

source: Emang.
en: yeah.

source: INI MASALAH YANG
en: different questions

source: Ck ah!
en: damn it!

source: YANG SALAH SIH...
en: well, it wasn’t wrong though...

source: Pada ROSE
en: Rose.

source: SAMA SKRIPSI SAYA.
en: with my thesis.

source: TAU POKOKNYA
en: if you don’t like it.

source: DIA BERHASIL
en: she’s managed

source: CKLEK!
en: clack

source: halo, mama?
en: hello, mom.

source: TOH...
en: well...

source: APA-APA,
en: it’s

source: Itu juga bagus loh nak!
en: I think you’d look great in it!

source: TERIMA
en: thank

source: MENYELAMATKAN
en: protect you

source: AJA?
en: to come?

source: episode 62 Untuk Orang Yang Paling Penting
en: episode 62 for the most important person in my life

source: Saya nggak mau masalah kita makin berat.
en: I don’t want to burden you with my problems.

source: RAHASIALAAAA~
en: it’s a secret~

source: Tapi pada akhirnya… kepercayaan itu gua juga yang ngancurin, dan gua gak bisa apa-apa.
en: in the end, I was the one who crumbled her faith once again. there was nothing I could do.

source: DOPPLEGANGER
en: a doppelganger?!

source: YANG SIA-SIA JUGA,
en: to come.

source: KE LAPANGAN
en: some observation

source: BINTANG
en: just

source: nggak pernah ngasih kesempatan untuk mencari jawaban...
en: I’ve never given myself a chance to find the answer...

source: WAKTU ITU SAYA DALAM KEADAAN NGGAK STABIL, SEMUA TANGGUNG JAWAB YANG SAYA TINGGALIN MENDADAK MENGHADANG SAYA, DAN SAYA NGGAK PUNYA PERSIAPAN APA-APA.
en: at the time, I was in a bad place. all the responsibilities I had left behind caught up to me all at once, and I wasn’t ready for them.

source: SIAPIN KACAMATA
en: I guess

source: SOK RENDAH
en: acting all inferior

source: BABAK BELUR
en: end up

source: Tapi kenapa jadi lebih berat dari yang biasanya…?
en: but, why do I feel worse than usual?

source: Brrr
en: vrrr

source: JAM BERAPA INI?!!
en: what time is it?!

source: dengan kualitas skripsi yang nggak bagus itu...
en: if my thesis was really that bad...

source: KELIRU!
en: after all!

source: dia kesepian
en: why is he feeling lonely

source: CUY,
en: hey,

source: UDAH YA
en: well, then,

source: "Ide Bagus!"
en: “What a splendid idea!”

source: mereka Semua
en: by using

source: BYUUR-
en: splash

source: KULIAH,
en: in

source: Zrsshh
en: shaaa

source: GUE NGGAK BISA BERHENTI MIKIRIN INI...
en: I just couldn’t stop thinking about this.

source: IYA, KAMU
en: Yeah... oh, my thesis defense

source: lalu kamu balik sama skripsi yang terburu-buru ini...
en: and now you’re here with this thesis, which is obviously written in a rush...

source: HAK KITA JUGA
en: we can’t force him

source: Soal gue ke Radi, gue nggak ngelakuin itu buat seneng-seneng
en: about what I did to radi... I didn’t do it for my own entertainment.

source: Oooh… Pantesan… Saya suka gak sengaja kebanting pass mau nutup..
en: ah... so that’s why! well, I’ve always closed it too forcefully.

source: …Ngapain dia masih bawa buku ini sih…
en: how long has she kept this here?

source: Kalo beasiswa gimana nak? dapet?
en: what about the scholarship? did you receive it?

source: Berharap kedatangan yang lain yaaa?
en: were you expecting someone else?

source: IBU DULU YA?
en: stay with me for a bit?

source: DEMI MASA DEPAN
en: it’s for my own

source: "JANGAN BURU-BURU NGEJELASIN PROSES BIKIN KARYA, JELASIN DULU TENTANG KARYANYA."
en: don’t jump right into the process of creating your piece. instead, describe what your work is about first.

source: KALO MAU.
en: if you want.

source: ITU BUKAN
en: he was radi,

source: GUE KIRA
en: I thought

source: tapi...
en: However...

source: Hahaha, nggak berubah ya kamu, nak.
en: hahaha... you haven’t changed one bit, maya.

source: seenggaknya saya udah tau sampai mana limit sa--
en: at least, now I know my limit--

source: ULANGTAHUN,
en: my birthdays,

source: KENAPA SAMPAI
en: how did you

source: WAH DIA TAKUT CICAK… SAYA BARU TAU…
en: I had no idea he was afraid of lizards...

source: Teriakan
en: said

source: siapa sih berisik banget?!!
en: ugh! so annoying!!!

source: KITA JUGA
en: we don’t know

source: nich,,
en: we do?!

source: sok kuat!
en: stop acting tough!

source: GUE AIS,
en: I’m harist!

source: SURUH PADA
en: their

source: APA PUN LAH ITU!
en: a whatever-you-call-it thing!

source: MONDAR-MANDIR
en: he looked

source: PADA AKHIRNYA...
en: eventually...

source: DIRI LO DAN
en: you and Radi...

source: KAYAK PERSONAL
en: a personal

source: SEMUANYA
en: you go,

source: KAMU AKAN TERASA
en: writing process will

source: GUE BACA LAGI,
en: it again, and I felt

source: TAU MAU BAHAS
en: the topic

source: UMM… SAYA NGGAK TAU BAGUS JELEKNYA KARENA SAYA NGGAK NGERTI KAYA SENI.
en: I can’t tell if a piece of art is good or bad because I don’t understand it.

source: INGET BANGET
en: that when you

source: nah ini orangnya?!
en: there he is!

source: RADI ANAK
en: wasn’t radi

source: mendengar
en: heard someone

source: Tenang aja, mereka pasti tau gue di mana kok, mereka gak sebarbar itu sampe harus ngacak-ngacak rumah orang
en: don’t worry, I’m sure they know where I am. they won’t tear this place apart just to catch a brat like me.

source: TAU MAU KEMANA,
en: any decision yet.

source: TAPI BERKAT
en: but thanks

source: biasanya ‘kan dia punyanya buku soal hewan langka?
en: doesn’t she enjoy reading about exotic animals?

source: SEKOLAH.
en: after school.

source: HIDAYAT?
en: gallery?

source: JAGAIN DIA SAMPE
en: she takes

source: PILIHAN AJA.
en: artworks.

source: TAPI SETELAH TAU LARAS BISA BERTAHAN SENDIRI TANPA AKU…
en: but since I’ve seen how well she does without me...

source: ANAK-ANAK ANGKATAN GUE JUGA NGGAK GITU KENAL RADI.
en: moreover, no one in my year is that close to him in terms of friendships.

source: adekmu juga cerita soal ini?
en: what do you know about this?

source: MERASA BERSALAH...
en: sleep soundly at night

source: SEMUANYA SERBA
en: seems to be so sophisticated

source: Tapi kenapa lo harus bawa masalah juga buat orang lain…?
en: but you shouldn’t drag others into your mess.

source: kalau saja...
en: If only...

source: Tapi lo ada benernya juga sih, bikin masalah adalah satu-satunya cara gue biar keluarga gue menyadari keberadaan gue
en: but I guess you’re right. I'm a big fan of causing trouble. it’s the only way to make them aware of my existence.

source: BENAR
en: she was

source: Iya, kayaknya buat sementara lewat pintu samping dulu deh.
en: I guess... we’ve got to use the side door for the time being.

source: INI GIMANA
en: how am I supposed

source: eh bangunin gak ini?
en: should we wake him up?

source: MAMA LIAT MAYA KELIATAN BAHAGIA DI FOTO ITU, MAKANYA MAMA MEMUTUSKAN BUAT NYIMPEN YANG SATUNYA LAGI.
en: when she saw how happy you looked in the pictures, she decided to keep one of them.

source: MAU INTERNSHIP...
en: to see my family.

source: BLAM
en: slam

source: 4 TAHUN SEKONTRAKAN
en: living together for

source: MIR.
en: okay.

source: Liat sekarang, lo jadi buronan keluarga.
en: now, look at you. you’ve become a fugitive from your family.

source: RUMAH LO
en: bring you

source: KE LU DAH YE.
en: later, okay?

source: KEMANA-MANA?!!
en: been looking

source: kalo aku tiba-tiba ngasih... aku takut terlalu ikut campur lagi.
en: and it isn't something I'd like to get involved in.

source: BERAPAAN YA SEWA TROTOAR DI BRAGA?
en: yeah, I wonder how much it would cost to rent the sidewalk.

source: gua tau gua salah...
en: I know that I made a mistake...
